# GetConstraintCandidatesForHandle Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
RebarConstraintsManager..::..GetConstraintCandidatesForHandle Method
RebarConstraintsManager Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetConstraintCandidatesForHandle(RebarConstrainedHandle) | For shape driven rebar returns all possible RebarConstraints that could be used for a specified RebarConstrainedHandle.For free form rebar will return an empty list. |
| GetConstraintCandidatesForHandle(RebarConstrainedHandle, ElementId) | For shape driven rebar returns all possible RebarConstraints belonging to references from the provided element that could be used for a specified RebarConstrainedHandle.For free form rebar will return an empty list. |
| GetConstraintCandidatesForHandle(RebarConstrainedHandle, Reference) | For shape driven rebar returns all possible RebarConstraints that will constrain RebarConstrainedHandle to the provided reference.For free form rebar will return an empty lists. |

# See Also
RebarConstraintsManager Class
RebarConstraintsManager Members
Autodesk.Revit.DB.Structure Namespace